//ทำงาน string

//Multiline String สามารถทำงานกับข้อความยาวๆได้ โดยการขึ้นบรรทัดใหม่แล้วไม่มีผิดพลาด '

//Interpolation สามรถแทรกตัวแปรลงในพื้นที่ Streing ได้โดยใช้ ${ชื่อตัวแปร} ร่วมกับ `

let customerName = "ศาล สานศิลป์"
let tel = "080-000-0000"
let city = "ระยอง"

const address = 'ชื่อลูกค้า : สมศรี ที่อยู่ 555/100 ถนนเฮฮา อำเภอเมือง จังหวีดเรียนดี เบอร์ติดต่อ : 012-345-6789'


const address2 = `ชื่อลูกค้า : สมศรี ที่อยู่ 555/100 ถนนเฮฮา 
อำเภอเมือง จังหวีดเรียนดี 
เบอร์ติดต่อ : 012-345-6789 =>ใหม่`


const address3 = `ชื่อลูกค้า : ${customerName}
อำเภอเมือง : ${city}
เบอร์ติดต่อ : ${tel}`

console.log(address3);